package api

import (
	"log"
	"net/http"
	"strings"

	"github.com/gin-gonic/gin"
)

type Services struct {
	Name        string
	Heavy       string
	Modificate  string
	Description string
	Photo       string
}

var data = [...]Services{
	{"Starship Mk1", "Super Heavy B3", "Космический корабль", "Полностью многоразовая транспортная система, предназначенная для перевозки экипажа и грузов на околоземную орбиту, Луну и Марс. Для взлета с Земли необходима сверхтяжелая ракета-носитель. Корабль может осуществлять посадку и взлеты с Луны и Марса.", "/image/1.png"},
	{"Starship SN1", "Super Heavy B3", "Космический корабль", "Полностью многоразовая транспортная система, предназначенная для перевозки экипажа и грузов на околоземную орбиту, Луну и Марс. Для взлета с Земли необходима сверхтяжелая ракета-носитель. Корабль может осуществлять посадку и взлеты с Луны и Марса.", "/image/2.png"},
	{"Starship SN2", "Super Heavy B3", "Транспортный корабль", "Корабль с отсеком для полезной нагрузки больше, чем любой обтекатель, который находится в эксплуатации или разработке, вплоть до очень больших аппаратов.", "/image/3.png"},
	{"Starship SN3", "Super Heavy B3", "Транспортный корабль", "Корабль с отсеком для полезной нагрузки больше, чем любой обтекатель, который находится в эксплуатации или разработке, вплоть до очень больших аппаратов.", "/image/4.png"},
	{"Starship SN4", "Super Heavy B3", "Лунный посадочный модуль", "Версия пилотируемого корабля, способного перевозить экипаж с низкой околоземной орбиты до лунной орбитальной станции Gateway и между станцией и поверхностью Луны.", "/image/5.jpeg"},
	{"Starship SN5", "Super Heavy B4", "Топливный танкер", "Танкер для доставки топлива на орбиту, где размещены топливные депо для дозаправки, необходимые для длительных перелётов.", "/image/6.png"},
	{"Starship SN6", "Super Heavy B4", "Лунный посадочный модуль", "Версия пилотируемого корабля, способного перевозить экипаж с низкой околоземной орбиты до лунной орбитальной станции Gateway и между станцией и поверхностью Луны.", "/image/7.png"},
	{"Starship SN7", "Super Heavy B4", "Топливный танкер", "Танкер для доставки топлива на орбиту, где размещены топливные депо для дозаправки, необходимые для длительных перелётов.", "/image/10.jpeg"},
	{"Starship SN8", "Super Heavy B4", "Транспортный корабль", "Корабль с отсеком для полезной нагрузки больше, чем любой обтекатель, который находится в эксплуатации или разработке, вплоть до очень больших аппаратов.", "/image/9.png"},
	{"Starship SN9", "Super Heavy B4", "Космический корабль", "Полностью многоразовая транспортная система, предназначенная для перевозки экипажа и грузов на околоземную орбиту, Луну и Марс. Для взлета с Земли необходима сверхтяжелая ракета-носитель. Корабль может осуществлять посадку и взлеты с Луны и Марса.", "/image/8.png"},
	{"Starship SN10", "Super Heavy B5", "Топливный танкер", "Танкер для доставки топлива на орбиту, где размещены топливные депо для дозаправки, необходимые для длительных перелётов.", "/image/11.jpeg"},
	{"Starship SN11", "Super Heavy B5", "Лунный посадочный модуль", "Версия пилотируемого корабля, способного перевозить экипаж с низкой околоземной орбиты до лунной орбитальной станции Gateway и между станцией и поверхностью Луны.", "/image/12.png"},
	{"Starship SN15", "Super Heavy B5", "Лунный посадочный модуль", "Версия пилотируемого корабля, способного перевозить экипаж с низкой околоземной орбиты до лунной орбитальной станции Gateway и между станцией и поверхностью Луны.", "/image/13.jpeg"},
	{"Starship SN20", "Super Heavy B4", "Космический корабль", "Полностью многоразовая транспортная система, предназначенная для перевозки экипажа и грузов на околоземную орбиту, Луну и Марс. Для взлета с Земли необходима сверхтяжелая ракета-носитель. Корабль может осуществлять посадку и взлеты с Луны и Марса.", "/image/14.jpeg"},
	{"Starship SN24", "Super Heavy B7", "Космический корабль", "Полностью многоразовая транспортная система, предназначенная для перевозки экипажа и грузов на околоземную орбиту, Луну и Марс. Для взлета с Земли необходима сверхтяжелая ракета-носитель. Корабль может осуществлять посадку и взлеты с Луны и Марса.", "/image/starship.jpg"},
}

func getItemById(c *gin.Context) {
	name := c.Param("name")
	for _, a := range data {
		if a.Name == name {
			c.HTML(http.StatusOK, "second.tmpl", a)
		}
	}
}

func getItems(c *gin.Context) {
	search := c.Query("search")
	var filterData []Services

	if search != "" {
		for _, a := range data {
			if strings.Contains(strings.ToLower(a.Name), strings.ToLower(search)) {
				filterData = append(filterData, a)
			}
		}
		c.HTML(http.StatusOK, "index.tmpl", gin.H{
			"Data":   filterData,
			"Search": search,
		})
		return
	}
	c.HTML(http.StatusOK, "index.tmpl", gin.H{
		"Data":   data,
		"Search": search,
	})
}

func StartServer() {

	log.Println("Server start up")

	r := gin.Default()

	r.LoadHTMLGlob("templates/*")
	r.Static("/image", "./static/image")
	r.Static("/styles", "./static/css")

	r.GET("/home", getItems)
	r.GET("/home/:name", getItemById)

	r.Run()
	log.Println("Server down")
}
